#+TITLE: Font Configuration
#+DATE: [2022-04-04 Mon 20:37]
#+KEYWORDS: gentoo font
#+OPTIONS: H:5
#+SETUPFILE: ../org-templates/level-1.org

**** fontconfig
Usually fontconfig will be pulled in by other dependencies. If not,
install it manually. System-wide configuration is shown as below.
#+begin_example
  # Config DIR: /etc/fonts/
  eselect fontconfig list↲

  Available fontconfig .conf files (* is enabled):
  [1]   10-autohint.conf
  [2]   10-hinting-full.conf
  [3]   10-hinting-medium.conf
  [4]   10-hinting-none.conf
  [5]   10-hinting-slight.conf *
  [6]   10-no-sub-pixel.conf
  [7]   10-scale-bitmap-fonts.conf *
  [8]   10-sub-pixel-bgr.conf
  [9]   10-sub-pixel-rgb.conf *
  [10]  10-sub-pixel-vbgr.conf
  [11]  10-sub-pixel-vrgb.conf
  [12]  10-unhinted.conf
  [13]  11-lcdfilter-default.conf *
  [14]  11-lcdfilter-legacy.conf
  [15]  11-lcdfilter-light.conf
  [16]  20-unhint-small-vera.conf *
  [17]  25-unhint-nonlatin.conf
  [18]  30-metric-aliases.conf *
  [19]  40-nonlatin.conf *
  [20]  43-wqy-zenhei-sharp.conf
  [21]  44-wqy-zenhei.conf
  [22]  45-generic.conf *
  [23]  45-latin.conf *
  [24]  49-sansserif.conf *
  [25]  50-user.conf *
  [26]  51-local.conf *
  [27]  60-generic.conf *
  [28]  60-latin.conf *
  [29]  60-liberation.conf
  [30]  65-fonts-persian.conf
  [31]  65-khmer.conf
  [32]  65-nonlatin.conf *
  [33]  69-unifont.conf
  [34]  70-no-bitmaps.conf
  [35]  70-yes-bitmaps.conf
  [36]  80-delicious.conf *
  [37]  85-wqy-bitmapsong.conf *
  [38]  90-synthetic.conf *
#+end_example

#+begin_src emacs-lisp :exports results
  ;; ~/.config/fontconfig/fonts.conf
  (with-temp-buffer
    (insert-file-contents "~/.config/fontconfig/fonts.conf")
    (buffer-string))
#+end_src

#+RESULTS:
#+begin_example
<?xml version="1.0"?>
<!DOCTYPE fontconfig SYSTEM "fonts.dtd">
<fontconfig>
  <selectfont>
    <rejectfont>
      <glob>/usr/share/fonts/wqy-zenhei/wqy-zenhei.ttc</glob>
      <glob>/usr/share/fonts/wqy-bitmapfont/wenquanyi_*</glob>
      <glob>/usr/share/fonts/urw-fonts/*</glob>
      <glob>/usr/share/fonts/liberation-fonts/*</glob>
    </rejectfont>
  </selectfont>

  <match target="scan">
	  <test name="family"><string>Migu 1M</string></test>
	  <edit name="charset">
		  <charset>
			  <!-- 基本拉丁(ASCII) -->
			  <range><int>0x0020</int><int>0x007E</int></range>
			  <!-- 拉丁-1增补 + 拉丁扩展A/B -->
			  <range><int>0x00A0</int><int>0x0181</int></range>
			  <int>0x0186</int><int>0x0189</int><int>0x018A</int>
			  <range><int>0x018E</int><int>0x0194</int></range>
			  <range><int>0x0198</int><int>0x019B</int></range>
			  <range><int>0x019D</int><int>0x01A1</int></range>
			  <range><int>0x01AF</int><int>0x01B1</int></range>
			  <range><int>0x01B3</int><int>0x01B6</int></range>
			  <range><int>0x01BF</int><int>0x01E3</int></range>
			  <range><int>0x01E6</int><int>0x01ED</int></range>
			  <range><int>0x01EF</int><int>0x01F5</int></range>
			  <range><int>0x01F7</int><int>0x01FF</int></range>
			  <range><int>0x0218</int><int>0x021F</int></range>
			  <range><int>0x0230</int><int>0x0233</int></range>
			  <int>0x0237</int><int>0x023D</int>
			  <!-- 国际音标 + 空格调整字母 -->
			  <range><int>0x0250</int><int>0x02FF</int></range>
			  <!-- 希腊语 -->
			  <range><int>0x0372</int><int>0x0375</int></range>
			  <int>0x037A</int><int>0x037E</int><int>0x038C</int>
			  <range><int>0x0384</int><int>0x038A</int></range>
			  <range><int>0x038E</int><int>0x03A1</int></range>
			  <range><int>0x03A3</int><int>0x03E1</int></range>
			  <!-- 西里尔语 -->
			  <range><int>0x0400</int><int>0x045F</int></range>
			  <int>0x0462</int><int>0x0463</int>
			  <range><int>0x0472</int><int>0x0475</int></range>
			  <int>0x0480</int><int>0x0481</int><int>0x0490</int><int>0x0491</int>
			  <int>0x04AE</int><int>0x04AF</int><int>0x04E8</int><int>0x04E9</int>
			  <!-- 货币符号 -->
			  <int>0x20A1</int><range><int>0x20A8</int><int>0x20AC</int></range>
			  <range><int>0x20AF</int><int>0x20B3</int></range><int>0x20B5</int>
			  <!-- 字母符号 -->
			  <int>0x2103</int><int>0x2113</int><int>0x2116</int><int>0x211E</int>
			  <int>0x2121</int><int>0x2122</int><int>0x2126</int><int>0x2127</int>
			  <!-- 数字形式(罗马) -->
			  <range><int>0x2160</int><int>0x216B</int></range>
			  <range><int>0x2170</int><int>0x217B</int></range>
			  <!-- 箭头 -->
			  <range><int>0x2190</int><int>0x2199</int></range>
			  <range><int>0x21B0</int><int>0x21B5</int></range>
			  <range><int>0x21C4</int><int>0x21CA</int></range>
			  <range><int>0x21D0</int><int>0x21D9</int></range>
			  <range><int>0x21E4</int><int>0x21ED</int></range>
			  <!-- 控制图片 -->
			  <range><int>0x2400</int><int>0x2426</int></range>
			  <!-- 带圈的字母与数字 -->
			  <range><int>0x2460</int><int>0x2473</int></range>
			  <range><int>0x24D0</int><int>0x24FF</int></range>
			  <range><int>0x2776</int><int>0x2793</int></range>
			  <!-- 数学乘号 + 拉丁扩展C -->
			  <int>0x2A2F</int><int>0x2C71</int><int>0x2C7D</int>
			  <!-- 平假名 + 片假名 + 片假名语音扩展 -->
			  <range><int>0x3041</int><int>0x3096</int></range>
			  <range><int>0x3099</int><int>0x30FF</int></range>
			  <range><int>0x31F0</int><int>0x31FF</int></range>
			  <!-- 拉丁扩展D -->
			  <int>0xA78B</int><int>0xA78C</int>
			  <!-- 拉丁组合字 -->
			  <range><int>0xFB00</int><int>0xFB04</int></range>
			  <!-- 字节顺序标记 -->
			  <int>0xFEFF</int>
		  </charset>
	  </edit>
  </match> 

  <!-- Default serif font -->
  <alias binding="strong">
    <family>serif</family>
    <prefer>
      <family>Noto Serif</family>
    </prefer>
    <accept>
      <family>Noto Serif CJK SC</family>
    </accept>
  </alias>

  <!-- Default sans-serif font -->
  <alias binding="strong">
    <family>sans-serif</family>
    <prefer>
      <family>Inter</family>
    </prefer>
    <accept>
      <family>Noto Sans CJK SC</family>
    </accept>
  </alias>

  <match target="font">
    <test name="family" compare="eq">
      <string>Inter</string>
    </test>
    <edit name="fontfeatures" mode="append">
      <string>ss02 on</string>
    </edit>
  </match>

  <!-- Default monospace font -->
  <alias binding="strong">
    <family>monospace</family>
    <prefer>
      <family>Migu 1MS</family>
    </prefer>
    <accept>
      <family>Noto Sans Mono CJK SC</family>
    </accept>
  </alias>

  <!-- Default system-ui font -->
  <!--
  <alias>
    <family>system-ui</family>
    <prefer>
      <family>Segoe UI Symbol</family>
    </prefer>
  </alias>
  -->

  <match target="pattern">
    <test qual="any" name="lang" compare="eq">
      <string>zh-HK</string>
    </test>
    <test qual="any" name="family" compare="eq">
      <string>sans-serif</string>
    </test>
    <edit name="family" mode="prepend" binding="strong">
      <string>Chiron Hei HK VF</string>
    </edit>
  </match>

  <!-- zh-Hant or zh-Hant-HK or zh-Hant-TW -->
  <match target="pattern">
    <test qual="any" name="lang" compare="contains">
      <string>zh-Hant</string>
    </test>
    <test qual="any" name="family" compare="eq">
      <string>sans-serif</string>
    </test>
    <edit name="family" mode="prepend" binding="strong">
      <string>Chiron Hei HK VF</string>
    </edit>
  </match>

  <match target="pattern">
    <test qual="any" name="lang" compare="eq">
      <string>yue</string>
    </test>
    <test qual="any" name="family" compare="eq">
      <string>sans-serif</string>
    </test>
    <edit name="family" mode="prepend" binding="same">
      <string>Chiron Hei HK VF</string>
    </edit>
  </match>

  <match target="pattern">
    <test qual="any" name="lang" compare="eq">
      <string>zh-TW</string>
    </test>
    <test qual="any" name="family" compare="eq">
      <string>sans-serif</string>
    </test>
    <edit name="family" mode="prepend" binding="strong">
      <string>Chiron Hei HK VF</string>
    </edit>
  </match>

  <!-- Misc Settings -->
  <!--
  <match>
    <edit name="dpi">
      <double>96</double>
    </edit>
  </match>
  -->

  <!-- ❶ Render Settings -->
  <match target="font">
    <edit name="antialias" mode="assign">
      <bool>true</bool>
    </edit>
    <!-- <edit name="hintstyle" mode="assign">
      <const>hintslight</const>
    </edit> -->
  </match>

</fontconfig>
#+end_example
❶ Use rgb sub-pixel ordering to improve glyph appearance on LCD
screens.  Changes affecting rendering, but not matching should always
use ~target="font"~.
